In [1]:
#데이터 사전처리
#누락 데이터 처리 : 머신러닝 시 알고리즘 왜곡현상 발생
#1. 누락 데이터 확인
import pandas as pd
import seaborn as sns

In [2]:
#titanic 데이터 load
df=sns.load_dataset('titanic')
df.info() #데이터프레임 데이터의 인덱스갯수와 컬럼별데이터 갯수 및 자료타입

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [3]:
#deck 컬럼이 누락데이터가 존재하는 것을 확인
#deck 컬럼의 누락데이터가 몇개인지 확인 : value_count(dropna=False)
df.deck.value_counts(dropna=False) #컬럼유일값들의 갯수,Nan 688개가 존재
print(len(df)) #전체 행의 갯수 :891개

891

In [4]:
#누락데이터를 직접 찾는 방법 : .isnull(), .notnull()
print(df.head().isnull()) #null이면 True, 아니면 False
print(df.head().notnull()) #null이면 False, 아니면 True
#누락데이터의 갯수 확인
print(df.head(891).isnull().sum(axis=0))

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False
   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
#isnull(), value_counts() -> 각 열의 값에 누락변수가 몇개씩 존재하는지 확인
miss_df = df.isnull()

for col in miss_df.columns:
    miss_count = miss_df[col].value_counts() # 각 열의 Nan 갯수
#if문은 nan데이터로 오류가 남 따라서 try구문을 쓰는게 좋음    
    try:
        print("{}:{}".format(col, miss_count[True]))
    except:
        print("{}:{}".format(col, 0))
        print("error : ",Exception)
#if, while, for문 복습 및 return

survived:0
error :  <class 'Exception'>
pclass:0
error :  <class 'Exception'>
sex:0
error :  <class 'Exception'>
age:177
sibsp:0
error :  <class 'Exception'>
parch:0
error :  <class 'Exception'>
fare:0
error :  <class 'Exception'>
embarked:2
class:0
error :  <class 'Exception'>
who:0
error :  <class 'Exception'>
adult_male:0
error :  <class 'Exception'>
deck:688
embark_town:2
alive:0
error :  <class 'Exception'>
alone:0
error :  <class 'Exception'>

In [6]:
# 누락데이터처리
# Nan 데이터가 500개 이상인 컬럼을 삭제
df_thresh = df.dropna(axis=1, thresh=500) # axis=1, thresh 열삭제 #ais=0, how any0행삭제
df_thresh.columns # deck 컬럼이 삭제된 자료

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [7]:
#age 컬럼에 Nan이 있는 인덱스(행)을 제거
# df_age = df.dropna(axis=0, how='any')
df_age = df_thresh.dropna(axis=0, how='any')
print(df_age.columns)
print(df_age.info())

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     712 non-null    int64
 1   pclass       712 non-null    int64
 2   sex          712 non-null    object
 3   age          712 non-null    float64
 4   sibsp        712 non-null    int64
 5   parch        712 non-null    int64
 6   fare         712 non-null    float64
 7   embarked     712 non-null    object
 8   class        712 non-null    category
 9   who          712 non-null    object
 10  adult_male   712 non-null    bool
 11  embark_town  712 non-null    object
 12  alive        712 non-null    object
 13  alone        712 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 69.0+ KB
None

In [8]:
#누락 데이터 치환 .fillna(값, inplace=True), .fillna(method='ffill'또는'bfill')
df['age'].head(10)

#age의 누락 데이터에 age의 평균값으로 치환
df_age=df.copy()
mean_age = df_age['age'].mean(axis=0)
df_age['age'].fillna(mean_age, inplace=True)

print(df_age['age'].head(10))
#age의 누락 데이터에 age의 최댓값으로 치환
df_age=df.copy()
max_age = df_age['age'].max(axis=0)
df_age['age'].fillna(max_age, inplace=True)
print(df_age['age'].head(10))

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    80.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [9]:
# embark_town : 825행부터 829 행까지 정보를 확인
df['embark_town'][825:830]

# 가장 빈번하게 나오는 값으로 대체 
most_data = df['embark_town'].value_counts(dropna=True).idxmax() # dropna=True -> default
#dropna=False 옵션(default는 True)을 주면 누락데이터(NaN)의 개수도 함께 카운트
#누락데이터가 가장 많으면 누락데이터로 대체 할 수있음 따라서 기본은
#누락데이터는 카운터하지않는 것이 좋다.
df_embark = df.copy()
df_embark['embark_town'].fillna(most_data, inplace=True)
df_embark['embark_town'][825:830]

# 근접한 (이웃) 값으로 대체 
df_embark = df.copy()
df_embark['embark_town'].fillna(method='ffill', inplace=True)
df_embark['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [10]:
df = pd.DataFrame({'c1':['a','a','b','a','b'],
              'c2':[1,1,1,2,2],
              'c3':[1,1,2,2,2]})
print(df);print()
#중복데이터 확인 .duplicatead(), True or False를 반환
print(df.duplicated())
print(df['c2'].duplicated())
                    
#중복 행 데이터를 제거 : .drop_duplicates()
df2=df.drop_duplicates()
print(df2);print()
             
#컬럼을 기준으로 중복 행 제거
df3=df.drop_duplicates(subset=['c2','c3'])
print(df3)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

0    False
1     True
2    False
3    False
4    False
dtype: bool
0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [11]:
# titanic 데이터를 load 해서
titanic = sns.load_dataset('titanic')
titanic.info()
#age 컬럼이 Nan이면 행을 삭제하고 age 컬럼을 기준으로 중복을 제거한 데/프 추출
titanic =titanic.dropna(subset=['age'], how='any',axis=0)
titanic.info()
#age 컬럼을 기준으로 중복을 제거한 데이터 프레임을 추출
titanic_age =titanic.drop_duplicates(subset=['age'])
titanic.info()

#모든 칼럼의 값이 같은 행을 제거
titanic_dup = titanic.drop_duplicates()
titanic_dup.info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   sibsp        714 non-null    int64
 5   parch        714 non-null    int64
 6   fare         714 non-null    float64
 7   embarked     712 non-null    object
 8   class        714 non-null    category
 9   who          714 non-null    object
 10  adult_male   714 non-null    bool
 11  deck         184 non-null    category
 12  embark_town  712 non-null    object
 13  alive        714 non-null    object
 14  alone        714 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 70.2+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   sibsp        714 non-null    int64
 5   parch        714 non-null    int64
 6   fare         714 non-null    float64
 7   embarked     712 non-null    object
 8   class        714 non-null    category
 9   who          714 non-null    object
 10  adult_male   714 non-null    bool
 11  deck         184 non-null    category
 12  embark_town  712 non-null    object
 13  alive        714 non-null    object
 14  alone        714 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 70.2+ KB

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
883         0       2    male  28.0      0      0  10.5000        S  Second
885         0       3  female  39.0      0      5  29.1250        Q   Third
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
883    man        True  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[678 rows x 15 columns]>

In [33]:
#데이터 표준화
# dataset/auto-mpg.csv 파일을 load
df = pd.read_csv('./dataset/auto-mpg.csv', header=None)

# column명을 지정
df.columns=['mpg','cylinders', 'displacement','horsepower','weight','acceleration',
           'model year', 'origin','name']

In [29]:
df.head()

# mpg 단위 : 갤런/mile -> 리터/km
mpg_to_kpl = 1.60934 / 3.78541 #(0.425)
df['kpl'] = df['mpg'] * mpg_to_kpl
df.head(3)

df['kpl'] = df['kpl'].round(2) #소수점 미만 2자리에서 반올림
df.head(3)

,mpg,cylinders,displacement,horespower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65

In [ ]:
#데이터의 자료형을 변환 분석을 위해선 숫자로 바꿔주어야 함
print(df.dtypes)
df.horsepower.dtype # 문자를 float으로 변환
# df['horsepower'] = df['horsepower'].astype('float') # error 발생
#horsepower의 자료를 검색, unique() 중복을 제거한 유일값을 나열 
df['horsepower'].unique()

In [38]:
#'?'문자를 처리 -># df['horsepower'] = df['horsepower'].astype('float')
#1. '?'(특수문자) -> Nan으로 치환
#2. Nan 데이터 행을 삭제
#3. 데이터의 형을 변환
import numpy as np
#1. '?' -> numpy.nan으로 대체 .replace(바꿀값, 대체할값, inplace=True)
df['horsepower'].replace('?',np.nan, inplace = True)

df['horsepower'].unique() #'?'-> nan으로 수정확인

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', nan, '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [40]:
#2. Nan 데이터 행을 삭제
df.dropna(subset=['horsepower'], axis=0, inplace =True)
print(df['horsepower'].unique())

['130.0' '165.0' '150.0' '140.0' '198.0' '220.0' '215.0' '225.0' '190.0'
 '170.0' '160.0' '95.00' '97.00' '85.00' '88.00' '46.00' '87.00' '90.00'
 '113.0' '200.0' '210.0' '193.0' '100.0' '105.0' '175.0' '153.0' '180.0'
 '110.0' '72.00' '86.00' '70.00' '76.00' '65.00' '69.00' '60.00' '80.00'
 '54.00' '208.0' '155.0' '112.0' '92.00' '145.0' '137.0' '158.0' '167.0'
 '94.00' '107.0' '230.0' '49.00' '75.00' '91.00' '122.0' '67.00' '83.00'
 '78.00' '52.00' '61.00' '93.00' '148.0' '129.0' '96.00' '71.00' '98.00'
 '115.0' '53.00' '81.00' '79.00' '120.0' '152.0' '102.0' '108.0' '68.00'
 '58.00' '149.0' '89.00' '63.00' '48.00' '66.00' '139.0' '103.0' '125.0'
 '133.0' '138.0' '135.0' '142.0' '77.00' '62.00' '132.0' '84.00' '64.00'
 '74.00' '116.0' '82.00']

In [44]:
#데이터타입을 'object'->'float'으로 변경
df['horsepower'] = df['horsepower'].astype('float')
print(df['horsepower'])

0      130.0
1      165.0
2      150.0
3      150.0
4      140.0
       ...
393     86.0
394     52.0
395     84.0
396     79.0
397     82.0
Name: horsepower, Length: 392, dtype: float64

In [52]:
print(df['origin'].unique())
df['origin'].replace({1:'USA',2:'EU',3:'JPN'},inplace=True)
print(df['origin'].unique())

['1' '3' '2']
['1' '3' '2']

In [46]:
#문자형을 범주형으로 변환
df['origin'] =df['origin'].astype('category')
print(df['origin'].dtype)

#범주형을 문자형으로 변환
df['origin'] =df['origin'].astype('str')
print(df['origin'].dtype)

#문제 'model year'의 데이터 타입과 데이터를 확인해 보시고 범주형으로 형변환

category
object

In [51]:
print(df['model year'].dtype,'\n', df['model year'].sample(3))
df['model year']=df['model year'].astype('category')
print(df['model year'].dtype,'\n', df['model year'].sample(3))

category
 52     71
23     70
282    79
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]
category
 122    73
102    73
193    76
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]